MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX130F064C.PIC
      <edc:SFRDef edc:_addr="0x1F80FA38" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="13" edc:access="----------------------------nnnn" edc:cname="IC5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC5R" edc:desc="" edc:mask="0xf" edc:name="IC5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FA3C" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F80FA48" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="14" edc:access="----------------------------nnnn" edc:cname="OCFAR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="OCFAR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0xf" edc:name="OCFAR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA4C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="15" edc:access="----------------------------nnnn" edc:cname="OCFBR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="OCFBR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFBR" edc:desc="" edc:mask="0xf" edc:name="OCFBR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA50" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="16" edc:access="----------------------------nnnn" edc:cname="U1RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U1RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0xf" edc:name="U1RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA54" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="17" edc:access="----------------------------nnnn" edc:cname="U1CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U1CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0xf" edc:name="U1CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA58" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="18" edc:access="----------------------------nnnn" edc:cname="U2RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U2RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2RXR" edc:desc="" edc:mask="0xf" edc:name="U2RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA5C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="19" edc:access="----------------------------nnnn" edc:cname="U2CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U2CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2CTSR" edc:desc="" edc:mask="0xf" edc:name="U2CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FA60" edc:offset="36"/>
      <edc:SFRDef edc:_addr="0x1F80FA84" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="20" edc:access="----------------------------nnnn" edc:cname="SDI1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0xf" edc:name="SDI1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA88" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="21" edc:access="----------------------------nnnn" edc:cname="SS1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0xf" edc:name="SS1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FA8C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F80FA90" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="22" edc:access="----------------------------nnnn" edc:cname="SDI2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0xf" edc:name="SDI2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
